read_verilog -formal rbFIFO.sv
prep -top rbFIFO
flatten
memory -nordff
setundef -undriven -init -expose
delete -output
techmap
abc -fast -g AND
write_aiger -ascii -symbols rbFIFO-3-15-3_NoOutput.aag