read_verilog -formal rbFIFO.sv
prep -top rbFIFO
flatten
memory -nordff
techmap
abc -fast -g AND
write_aiger -ascii -symbols rbFIFO-1-3-1.aag